<?php


namespace App\Console\Commands;

use Illuminate\Console\Command;
use App\Jobs\UpdateUserInfoToMongoJob;
use App\Models\SfaceRecord;
use App\Constant\NeteaseCustomCode;

class CarexuanCommand extends Command
{
    protected $signature   = 'carexuan:test';
    protected $description = '刘懿萱测试脚本';

    public function __construct()
    {
        parent::__construct();
    }

    public function handle()
    {
        $action = $this->choice('请选择功能', [
            'test'                   => '通用测试方法',
            'recall_test'            => '测试撤回消息',
            'send_jpush_msg_to_user' => '给某个用户发送一条测试极光推送',
            'add_custom_service_script' => '添加客服快捷回复话术',
        ]);
        switch ($action) {
            case 'test':
                $data = [
                    'type' => NeteaseCustomCode::DELETE_LOGIN,
                    'data' => [
                        'uuid' => 178151965778247680
                    ]
                ];
                dd(pocket()->netease->msgSendCustomMsg(151968463340961792, 178151965778247680, $data));
                dd(pocket()->aliGreen->sfaceAddPerson(248011160070811648, SfaceRecord::GROUP_FACE_BLACK));
                pocket()->aliGreen->sfaceAddFace(184604744024604672, ['uploads/face_auth/aac999f0e6d1f731a7a4a27ced9f3b12.png']);

                break;
            case 'recall_test':
                $userId = $this->ask('请输入要撤回的用户ID');
                pocket()->user->recallUserMsg($userId);
                break;
            case 'send_jpush_msg_to_user':
                $userId = $this->ask('请输入要发送的用户ID');
                $user   = rep()->user->getById($userId);
                pocket()->push->pushToUser($user, 'test');
                break;
            case 'add_custom_service_script':
                $data = [
                    "300"=>[
                        "您上传的相册不合格，存在与头像相同重复照片，请重新上传3-5张，再次申请",
                        "您上传的相册不合格，存在暴露、模糊、白边照片，请重新上传3-5张，再次申请",
                        "您上传的微信二维码不合格，存在非加好友的二维码，请重新上传，再次申请",
                        "您上传微信二维码不合格，存在性别不符的二维码，请重新上传，再次申请",
                        "您上传的头像不合格，存在暴露、模糊、白边照片，请重新上传，再次申请",
                        "您上传的照片与注册信息年龄不符，请勿再次提交",
                        "您的昵称和签名违规，请勿透露第三方联系方式，修改后重新申请"
                    ],
                    "301"=>[
                        "您已被举报涉嫌诈骗，请遵守小圈平台使用规则，否则经查证属实我们有权拒绝向您提供服务",
                        "经多人举报，您以各种理由向多人索要钱财，涉嫌多次诈骗，本平台决定停止向您提供任何服务，您的小圈账号将永久封禁，不再解封",
                        "禁止利用本平台进行卖淫、诈骗、抢劫、敲诈勒索等任何违法犯罪行为，现接到举报，举报人声称您涉嫌前述行为，如查证属实，本平台将停止向您提供任何服务，您的账号将永久封禁。",
                        "禁止利用本平台进行卖淫、诈骗、抢劫、敲诈勒索等任何违法犯罪行为，现接到举报，根据投诉人提供的资料，本平台有理由认为您涉嫌前述行为，现决定停止向您提供任何服务，您的账号将永久封禁。",
                        "您已被举报聊天过程中存在不文明发言行为，请注意言行举止，文明交流 ，如再次发现会对您的账号进行一定期限内封禁处理",
                        "经多人举报，您存在不文明发言行为，本平台决定对您的账号处以封禁7天处理。请您耐心等待封禁时间结束，注意言行举止，文明交流，净化小圈交友环境，如再次发现前述行为，平台有权进行延长封禁期限或者封号处理",
                        "您已被举报非本人使用小圈账号，平台禁止账号共享行为，我们将对举报情形进行核实，如查证属实，平台有权拒绝提供服务，并对您的账号进行处理。",
                        "经核实，您违反平台相关规定，使用他人账号或非本人账号，违反平台运营理念，现对您的账号进行永久封禁，不再向您提供平台服务",
                        "附近的用户已经通过站内消息找过您多次，建议您对用户的信息及时回复，这样对您在平台的权重会受到一定影响。",
                        "鉴于平台收到多名用户反馈，您没有回复信息，我们有理由认为您的账户属于不活跃账户，平台将暂时对您的账户进行冻结，如需要继续使用该账户请联系客服申请解冻。",
                        "您已被举报微信搜索不到，如同一类型被举报过多，为了避免无效占用更多的平台资源，平台有权向您停止提供服务。",
                        "接到接到多人举报微信搜索不到，导致封禁，封禁7天。"
                    ],
                    "302"=>[
                        "您举报的用户违规行为，本平台已经警告该用户，但是您提供的举报证据不足，请补充相应证据，再次提交投诉申请或联系人工客服。",
                        "感谢您的反馈，我们已对该用户进行封禁处理。",
                        "您举报的用户违规行为，本平台已经警告该用户，但是您提供的举报证据不足，请补充相应证据，再次提交投诉申请或联系人工客服。",
                        "禁止利用本平台进行任何不法交易行为，如有被诈骗、抢劫、造成财产损失或人身伤害，建议选择报警处理，平台将依法配合警方调查。",
                        "感谢您的反馈，我们已对您举报的用户进行处理或者警告",
                        "感谢您的反馈，我们已经对该用户进行处理",
                        "感谢您的反馈，我们已对该用户进行封禁处理",
                        "感谢您的反馈，我们已对该用户进行处理或者警告，建议您优先选择在线活跃的用户进行交流"
                    ],
                    "303"=>[
                        "您好，您修改的资料存在违规内容，请您更改后再次提交，修改时昵称、个人简介不得带有任何违规文字、词汇，包含但不限于：辱骂、侮辱、涉黄、低俗、国家政事等",
                        "您好，您修改的资料存在第三方联系方式，请您更改后再次提交，修改时昵称、个人简介不得带有任何第三方联系方式的文案或暗示",
                        "您好，您修改的资料疑似广告内容，请您更改后再次提交，修改时昵称、个人简介不得带有任何宣传、暗示等广告性质文字、词汇"
                    ],
                    "304"=>[
                        "您好，由于您提交的微信号搜索不到，微信号不存在，您的微信资料修改失败，请您补充资料后重新提交",
                        "您好，由于您提交的微信号与二维码不符，不是一个微信账号，您的微信资料修改失败，请您补充资料后重新提交",
                        "您好，由于您未提交微信二维码，您的微信资料修改失败，请您补充资料后重新提交",
                        "您好，由于您提交的微信号性别为男，您的微信资料修改失败，魅力女生的微信号应为女性，请您补充资料后重新提交"
                    ],
                    "305"=>[
                        "您好，您的头像/相册图片尺度过大，请您尽快更改，如发现您没有进行更改，将进行封禁3天处理",
                        "您好，您的头像/相册图片涉嫌广告信息或包含第三方联系方式，请您尽快更改，如发现您没有进行更改，将进行封禁3天处理",
                        "您好，您的头像/相册图片含有涉政违规内容，请您尽快更改，如发现您没有进行更改，将进行封禁3天处理",
                        "您好，您的头像/相册图片含有违规内容，请您尽快更改，如发现您没有进行更改，将进行封禁3天处理"
                    ]
                ];
                foreach ($data as $key=>$value){
                    foreach ($value as $v){
                        $one = [];
                        $one['p_id'] = 0;
                        $one['code'] = '';
                        $one['type'] = $key;
                        $one['name'] = $v;
//                        d($one);
                        $rs = rep()->option->m()->updateOrCreate($one);
                        d($rs->toArray());
                    }
//
                }
        }
    }
}
